# HeatTransferCoefficient Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisConstruction..::..HeatTransferCoefficient Property
EnergyAnalysisConstruction Class See Also
---
The heat transfer coefficient value (U-value) of the construction.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double HeatTransferCoefficient { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HeatTransferCoefficient As Double
	Get
```

Visual C++
---
```text
public:
property double HeatTransferCoefficient {
	double get ();
}
```

# Remarks
A heat transfer coefficient measured in W/m^2K
# See Also
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace